#+STARTUP: overview
* Personal keymap
#+begin_src emacs-lisp
  (dotimes (n 10)
    (global-unset-key (kbd (format "C-%d" n)))
    (global-unset-key (kbd (format "M-%d" n)))
    )

  (defun org-agenda-show-agenda-and-todo (%optional arg)
    (interactive "P")
    (org-agenda arg "c")
    (org-agenda-fortnight-view))

  ;; set p my own map
  (define-prefix-command 'z-map)
  (global-set-key (kbd "C-1") 'z-map)

  (define-key z-map (kbd "m") 'mu4e)
  (define-key z-map (kbd "e") 'bjm/elfeed-load-db-and-open)
  (define-key z-map (kbd "1") 'gor-glocal-cycle)
  (define-key z-map (kbd "a") 'org-agenda-show-agenda-and-todo)
  (define-key z-map (kbd "s") 'flyspell-correct-word-before-point)
  (define-key z-map (kbd "i") (lambda () (interactive) (find-file "~/workx/orgfiles/i.org")))
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (find-file ~/workx/orgfiles/i.org) |

* using swiper
#+begin_src emacs-lisp
  (use-package wgrep
    :ensure t
    )
#+end_src

#+RESULTS:
: /home/lam/.fzf/bin/fzf -f %s

